app/controllers/articles_controller.rb

	def index
		@articles = Article.all
		@page_title = "Welcome on the Ruby Blog !"
		@articles = Article.all.paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"